alibaba/AliOS-Things/platform/mcu/nrf52xxx/Drivers/proprietary_rf/gzll/nrf_gzll.h
/**
 * Copyright (c) 2012 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
/**
 * @file
 * @brief Gazell Link Layer API.
 */

#ifndef NRF_GZLL_H__
#define NRF_GZLL_H__

#include <stdbool.h>
#include "nrf.h"
#include "nrf_gzll_constants.h"

#ifdef __cplusplus
extern "C" {
#endif


/**
* @defgroup gzll_02_api Gazell Link Layer
* @{
* @ingroup modules_01_gzll
* @brief Gazell Link Layer Application Programming Interface (API).
*/


/**
 * @enum nrf_gzll_mode_t
 * @brief Enumerator used for selecting Gazell mode.
 */
typedef enum
{
  NRF_GZLL_MODE_DEVICE,       ///< Device mode
  NRF_GZLL_MODE_HOST,         ///< Host mode
  NRF_GZLL_MODE_SUSPEND,      ///< Suspend mode ("disabled with timer running")
} nrf_gzll_mode_t;


/**
 * @enum nrf_gzll_device_channel_selection_policy_t
 * @brief Enumerator used for selecting Gazell Device channel
 * selection policy.
 */
typedef enum
{
  NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_SUCCESSFUL, ///< Start on previous successful channel
  NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_CURRENT,    ///< Start on channel currently monitored by Host
} nrf_gzll_device_channel_selection_policy_t;


/**
 * @enum nrf_gzll_tx_power_t
 * @brief Enumerator used for selecting the transmit (TX) power.
 */
typedef enum
{
  NRF_GZLL_TX_POWER_4_DBM,          ///<  4 dBm transmit power.
  NRF_GZLL_TX_POWER_0_DBM,          ///<  0 dBm transmit power.
  NRF_GZLL_TX_POWER_N4_DBM,         ///< -4 dBm transmit power.
  NRF_GZLL_TX_POWER_N8_DBM,         ///< -8 dBm transmit power.
  NRF_GZLL_TX_POWER_N12_DBM,        ///< -12 dBm transmit power.
  NRF_GZLL_TX_POWER_N16_DBM,        ///< -16 dBm transmit power.
  NRF_GZLL_TX_POWER_N20_DBM         ///< -20 dBm transmit power.
} nrf_gzll_tx_power_t;


/**
 * @enum nrf_gzll_datarate_t
 * @brief Enumerator used for selecting the radio datarate.
 */
typedef enum
{
#ifdef NRF51
  NRF_GZLL_DATARATE_250KBIT = 0,    ///<  250 Kbps datarate, available only for the nRF51.
#endif
  NRF_GZLL_DATARATE_1MBIT   = 1,    ///<  1 Mbps datarate.
  NRF_GZLL_DATARATE_2MBIT   = 2     ///<  2 Mbps datarate.
} nrf_gzll_datarate_t;


/**
 * @enum nrf_gzll_xosc_ctl_t
 * @brief Enumerator used for specifying whether switching the
 * external 16 MHz oscillator on/off shall be handled automatically
 * inside Gazell or manually by the application.
 */
typedef enum
{
  NRF_GZLL_XOSC_CTL_AUTO,   ///< Switch XOSC on/off automatically
  NRF_GZLL_XOSC_CTL_MANUAL  ///< Switch XOSC on/off manually
} nrf_gzll_xosc_ctl_t;

/**
 * @enum nrf_gzll_error_code_t
 * @brief Enumerator used for error codes for Gazell API functions
 */
typedef enum
{
  NRF_GZLL_ERROR_CODE_NO_ERROR                            =  0,
  ///< No error has been detected.
  NRF_GZLL_ERROR_CODE_FAILED_TO_INITIALIZE                =  1,
  ///< The function NRF_GZLL_init failed.
  NRF_GZLL_ERROR_CODE_ATTEMPTED_TO_CONFIGURE_WHEN_ENABLED =  2,
  ///< A call to a configuration 'set' function was made while Gazell was
  ///< enabled.
  NRF_GZLL_ERROR_CODE_POINTER_IS_NULL                     =  3,
  ///< A null pointer was given as an input to a function.
  NRF_GZLL_ERROR_CODE_INVALID_PIPE                        =  4,
  ///< An invalid pipe number was given as an input to a function.
  NRF_GZLL_ERROR_CODE_INVALID_MODE                        =  5,
  ///< An invalid value for the nrf_gzll_mode_t enumerator was given as input
  ///<  to a function.
  NRF_GZLL_ERROR_CODE_INVALID_PAYLOAD_LENGTH              =  6,
  ///< An invalid payload length was given as an input to a function.
  NRF_GZLL_ERROR_CODE_INVALID_CHANNEL_TABLE_SIZE          =  7,
  ///< An invalid channel table size was given as an input to a function.
  NRF_GZLL_ERROR_CODE_INSUFFICIENT_PACKETS_AVAILABLE      =  8,
  ///< There are insufficient packets in the Gazell memory pool to
  ///< successfully execute the operation.
  NRF_GZLL_ERROR_CODE_ATTEMPTED_TO_ADD_TO_FULL_FIFO       =  9,
  ///< There is insufficient space in the TX FIFO for the data packet.
  NRF_GZLL_ERROR_CODE_NO_SPACE_IN_RX_FIFO_FOR_ACK         = 10,
  ///< There is insufficient space in the RX FIFO for the ACK.
  NRF_GZLL_ERROR_CODE_ATTEMPTED_TO_FETCH_FROM_EMPTY_FIFO  = 11,
  ///< Attempted to fetch a packet from an empty FIFO. Use the functions nrf_gzll_get_tx_fifo_packet_count() or nrf_gzll_get_rx_fifo_packet_count()
  NRF_GZLL_ERROR_CODE_ATTEMPTED_TO_FLUSH_WHEN_ENABLED     = 12,
  ///< Attempted to fetch a packet from an empty FIFO. Use the functions nrf_gzll_get_tx_fifo_packet_count() or nrf_gzll_get_rx_fifo_packet_count()
  NRF_GZLL_ERROR_CODE_INVALID_PARAMETER                   = 14,
  ///< Attempted to set a variable which was not valid.
  NRF_GZLL_ERROR_CODE_INTERNAL_ASSERT_OCCURRED            = 15,
  ///< An internal assert occurred.
  NRF_GZLL_ERROR_CODE_CALLBACK_NOT_IMPLEMENTED            = 16,
  ///< A callback was called but not implemented by the application.
  NRF_GZLL_ERROR_CODE_INVALID_ADDRESS                     = 17,
  ///< Invalid pipe 0 address detected, see Anomaly 107 at nRF52832 errata document.
  NRF_GZLL_ERROR_CODE_NUMBER_OF_ERROR_CODES               = 18,
  ///< Number of possible error codes.
} nrf_gzll_error_code_t;


/**
 * @struct nrf_gzll_device_tx_info_t;
 * @brief Data structure containing information about the last packet
 *        transmission.
 */
typedef struct
{
  bool payload_received_in_ack;
  ///<  A payload was received in the ACK.
  uint16_t num_tx_attempts;
  ///< Number of attempts used on previous Device packet transmission.
  uint16_t num_channel_switches;
  ///< Number of channel switches needed during previous packet transmission.
  int16_t rssi;
  ///< Received signal strength indicator in dBm. @sa nrf_gzll_enable_rssi().
} nrf_gzll_device_tx_info_t;

/**
 * @struct nrf_gzll_host_rx_info_t;
 * @brief Data structure containing information about the last packet
 *        received.
 */
typedef struct
{
  bool packet_removed_from_tx_fifo;
  ///<  A payload was received in the ACK.
  int16_t rssi;
  ///< Received signal strength indicator in dBm. @sa nrf_gzll_enable_rssi().
} nrf_gzll_host_rx_info_t;




/******************************************************************************/
/** @name General API functions
 *  @{ */
/******************************************************************************/


/**
 * @brief Initialize Gazell.
 *
 * @param mode The mode to initialize Gazell in.
 *
 * @retval true if Gazell initialized.
 * @retval false if Gazell failed to initialize.
 */
bool nrf_gzll_init(nrf_gzll_mode_t mode);


/**
 * @brief Enable Gazell.
 *
 * When enabled the behaviour described for the current Gazell Link Layer mode
 * will apply.
 *
 * @retval false if nrf_gzll_init has not previously been called or invalid address
 *               has been set - see Anomaly 107 at nRF52832 errata document.
 */
bool nrf_gzll_enable(void);

/**
 * @brief Disable Gazell.
 *
 * When calling this function the Gazell Link Layer will begin disabling,
 * and will be fully disabled when Gazell calls nrf_gzll_disabled().
 * If there are any pending notifications, or if any new notifications are
 * being added to the internal notification queue while Gazell is disabling,
 * these will be sent to the application before Gazell is fully disabled.
 *
 * After Gazell has been fully disabled, no more notifications will be sent to
 * the application.
 */
void nrf_gzll_disable(void);


